org.eclipse.swordfish.samples/org.eclipse.swordfish.samples.httpendpoint/src/main/resources/META-INF/spring/simple-client.xml

<beans xmlns="http://www.springframework.org/schema/beans"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:osgi="http://www.springframework.org/schema/osgi"
	xmlns:util="http://www.springframework.org/schema/util" xmlns:p="http://www.springframework.org/schema/p"
	xsi:schemaLocation="
  http://www.springframework.org/schema/beans
  http://www.springframework.org/schema/beans/spring-beans.xsd
  http://www.springframework.org/schema/util
  http://www.springframework.org/schema/util/spring-util.xsd
  http://www.springframework.org/schema/osgi
  http://www.springframework.org/schema/osgi/spring-osgi.xsd">
	<osgi:reference id="nmr" interface="org.apache.servicemix.nmr.api.NMR"/>
		
	
	
	<bean id="simpleClient" class="org.eclipse.swordfish.endpoints.http.SimpleClient"		 
		p:nmr-ref="nmr" >
		<property name="dataToSend">
    	 <value><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing"><soap:Header><wsa:Action>http://cxf.samples.swordfish.eclipse.org//BookingService/createReservation</wsa:Action></soap:Header><soap:Body><ns2:createReservation xmlns:ns2="http://cxf.samples.swordfish.eclipse.org/"><passengers><age>24</age><firstName>Volodymyr</firstName><id>1</id><lastName>Zhabiuk</lastName></passengers><flight><flightNumber>LC023</flightNumber><id>1</id></flight></ns2:createReservation></soap:Body></soap:Envelope>]]></value>
		</property>
	</bean>
	
	
</beans>